УТ/src/DataProcessors/СервисSellmonitor/СервисSellmonitor.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СервисSellmonitor</name>
</mdclass:DataProcessor>

УТ/src/InformationRegisters/СтатусыПубликацииОбъектовМаркетплейсаOzon/СтатусыПубликацииОбъектовМаркетплейсаOzon.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПубликацииОбъектовМаркетплейсаOzon</name>
  <resources>
    <name>ИдентификаторПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОбъектаМаркетплейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовМаркетплейсаOzon</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПродаетсяПоСхемеРаботыFBO</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПродаетсяПоСхемеРаботыFBS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПродаетсяПоСхемеРаботыDBS</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОбъектаМаркетплейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъектаМаркетплейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОбъектаМаркетплейса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникКатегорииМаркетплейса</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКатегорииМаркетплейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКатегорииМаркетплейса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеОбъекта</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъединяетсяВОднуКарточку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеОбъединенияВОднуКарточку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияНаМаркетплейсе</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновленияНаМаркетплейсе</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторFBOSKU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторFBSSKU</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦеновойИндекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникиСхожихПредложений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальностиОстатковМаркетплейса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокFBO</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезервFBO</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокFBS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезервFBS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузкиЦенПродажи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаДоСкидки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаСоСкидкой</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяЦена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененыРеквизиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КрупногабаритныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УцененныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьУцененныеАналоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УчетнаяЗаписьМаркетплейса</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбъектаМаркетплейса</name>
    <type>
      <types>EnumRef.ВидыОбъектовМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПартнера</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПубликации</name>
    <type>
      <types>CatalogRef.СертификатыНоменклатуры</types>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/Enums/ВидыМаркетплейсов/ВидыМаркетплейсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыМаркетплейсов</name>
  <enumValues>
    <name>МаркетплейсЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>МаркетплейсOzon</name>
  </enumValues>
  <enumValues>
    <name>МаркетплейсWildberries</name>
  </enumValues>
  <enumValues>
    <name>МаркетплейсLamoda</name>
  </enumValues>
  <enumValues>
    <name>СервисАналитикиSellmonitor</name>
  </enumValues>
</mdclass:Enum>

УТ/src/DataProcessors/СервисSellmonitor/Forms/ПодборКарточекТоваров/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидМаркетплейса = Параметры.ВидМаркетплейса;
	УчетнаяЗапись = Параметры.УчетнаяЗапись;
	
	ЭтоOzon = Параметры.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon;
	
	Элементы.ГруппаМаркетплейсOzon.Видимость = ЭтоOzon;
	Если ЭтоOzon Тогда
		ЭлементОтбора = СписокМаркетплейсOzon.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
		ЭлементОтбора.ПравоеЗначение = Перечисления.СтатусыОбъектовМаркетплейсаOzon.ВАрхиве;
		ЭлементОтбора.Использование = Истина;
		
		СписокМаркетплейсOzon.Параметры.УстановитьЗначениеПараметра("УчетнаяЗапись", УчетнаяЗапись);
		ЭлементОтбора = СписокМаркетплейсOzon.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Ложь;
	Иначе
		СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		СвойстваСписка.ТекстЗапроса = "";
		ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СписокМаркетплейсOzon, СвойстваСписка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокМаркетплейсOzon

&НаКлиенте
Процедура СписокМаркетплейсOzonВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Закрыть(ПолучитьРезультатВыбора(Значение));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьРезультатВыбора(ВыбранныеЗначения)
	
	Результат = Новый Соответствие;
	
	ТаблицаДляПоиска = Новый ТаблицаЗначений;
	Для Каждого Измерение Из Метаданные.РегистрыСведений.СтатусыПубликацииОбъектовМаркетплейсаOzon.Измерения Цикл
		ТаблицаДляПоиска.Колонки.Добавить(Измерение.Имя, Измерение.Тип);
	КонецЦикла;
	
	Для Каждого ВыбранноеЗначение Из ВыбранныеЗначения Цикл
		НоваяСтрока = ТаблицаДляПоиска.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыбранноеЗначение);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДляПоиска.УчетнаяЗаписьМаркетплейса КАК УчетнаяЗаписьМаркетплейса,
	|	ТаблицаДляПоиска.ВидОбъектаМаркетплейса КАК ВидОбъектаМаркетплейса,
	|	ТаблицаДляПоиска.Номенклатура КАК Номенклатура,
	|	ТаблицаДляПоиска.Характеристика КАК Характеристика,
	|	ТаблицаДляПоиска.Упаковка КАК Упаковка,
	|	ТаблицаДляПоиска.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ТаблицаДляПоиска.ОбъектПубликации КАК ОбъектПубликации
	|ПОМЕСТИТЬ врТаблицаДляПоиска
	|ИЗ
	|	&ТаблицаДляПоиска КАК ТаблицаДляПоиска
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	УчетнаяЗаписьМаркетплейса,
	|	ВидОбъектаМаркетплейса,
	|	Номенклатура,
	|	Характеристика,
	|	Упаковка,
	|	НоменклатураПартнера,
	|	ОбъектПубликации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеРегистра.ИдентификаторПубликации КАК ИдентификаторПубликации,
	|	ДанныеРегистра.НаименованиеОбъектаМаркетплейса КАК НаименованиеМП
	|ИЗ
	|	РегистрСведений.СтатусыПубликацииОбъектовМаркетплейсаOzon КАК ДанныеРегистра
	|ГДЕ
	|	(ДанныеРегистра.УчетнаяЗаписьМаркетплейса, ДанныеРегистра.ВидОбъектаМаркетплейса, ДанныеРегистра.Номенклатура,
	|		ДанныеРегистра.Характеристика, ДанныеРегистра.Упаковка, ДанныеРегистра.НоменклатураПартнера,
	|		ДанныеРегистра.ОбъектПубликации) В
	|		(ВЫБРАТЬ
	|			врТаблицаДляПоиска.УчетнаяЗаписьМаркетплейса,
	|			врТаблицаДляПоиска.ВидОбъектаМаркетплейса,
	|			врТаблицаДляПоиска.Номенклатура,
	|			врТаблицаДляПоиска.Характеристика,
	|			врТаблицаДляПоиска.Упаковка,
	|			врТаблицаДляПоиска.НоменклатураПартнера,
	|			врТаблицаДляПоиска.ОбъектПубликации
	|		ИЗ
	|			врТаблицаДляПоиска КАК врТаблицаДляПоиска)";
	
	Запрос.УстановитьПараметр("ТаблицаДляПоиска", ТаблицаДляПоиска);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ИдентификаторПубликации, Выборка.НаименованиеМП);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
